{
  "about_me": {
    "pic": "/img/me.jpg",
    "msg": [
      "Welcome to my website!",
      "My name is Henrik Gerdes. I'm a total nerd for information technology and have an absolute passion for solving specific, difficult and large-scale problems in computer science and project management. I love finding elegant & efficient ways to automate recurring tasks and provide their functionality to in a user-friendly way to other people. Abstraction ForTheWin 🙌. I studied computer science at the University of Osnabrück (Germany) where I learnd many low-level concepts for programming and architectural design. I did some projects with computer/game graphics, low-level socket programming, graph algorithms and implemented some algorithms for traditional AI problems. But most importantly, I acquired the skill for strategical problem-solving. While writing my bachelor's thesis on applying DevOps principles to the software development process, I worked at a local software company implementing these principles.",
      "Now I'm still working at that local IT company as a Systems/DevOps engineer. I developed a new deployment strategy and designed the entire monitoring, alerting, maintenance and backup system - primary based on OpenSource software. Right now I'm implementing ChatOps practices and expanding my knowledge of different cloud provider technologies, while further improving automated resource provisioning, monitoring, and maintenance tasks.",
      "I love experimenting with different technologies and sharing my knowledge with others, even though if it might involve spending some quality time with your favorite rubber 🦆. ",
      "Check out my Blog where I document some of my experiences!"
    ]
  },
  "home_row": [
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (1).jpg"
    },
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (2).jpg"
    },
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (3).jpg"
    },
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (4).jpg"
    }
  ],

  "fav_projects": [
    {
      "title": "Galaxy Fight",
      "msg": [
        "A round based 2D strategy game with 3D PvP fights.",
        "Players fight over the dominace of planets, while mining ressources to build new ships.",
        "It is basically a collection of my C++ skills. Including Templates,Boost, QT, OpenGL and SDL."
      ],
      "pic": "/img/galaxy.png"
    },
    {
      "title": "Pacmap",
      "msg": [
        "Want to play Pacman in your home town streets? Want to compete with your friends?",
        "Than play Pacmap. Its an multiplayer Pacman on street maps."
      ],
      "pic": "/img/pac.png"
    },
    {
      "title": "Beeblebrox CTF",
      "msg": [
        "A VM for IT-Sec starters to learn Unix and find common IT Security flaws.",
        "Full level based CTF with a accompanying website similare to the challenges at OverTheWire",
        "It includes Bash-Scripting, Web-Scraping and manipulation of Web-Authentication."
      ],
      "pic": "/img/ctf.png"
    }
  ],
  "language": [
    {
      "title": "PYTHON",
      "msg": "2 years data mining and manipulation. Also use of AI algorithms, PyGame and general scripting with Python 3.",
      "link": "none"
    },
    {
      "title": "WEB",
      "msg": "Fluid with HTML, CSS, JavaScript, TypeScript. NodeJS backend and frontend projects using express, OAS and VUE.JS. I can to create REST APIs and responsive website with bootstrab.",
      "link": "none"
    },
    {
      "title": "C/C++",
      "msg": "1 1/2 years developing algorithms, OpenGL vertices and GUI elements using QT",
      "link": "none"
    },
    {
      "title": "JAVA",
      "msg": "3 years of object oriented programming, multimedia tools, datatypes and software-engineering concepts.",
      "link": "none"
    }
  ],
  "skill": [
    "Git/SVN",
    "GitLab CI",
    "GitHub Actions",
    "Azure - learning",
    "AWS - learning",
    "Terraform - learning",
    "Hetzner",
    "Heroku",
    "Netify",
    "Linux",
    "SSH",
    "Ansible",
    "Docker Swarm",
    "Kubernetes - learning",
    "MariaDB",
    "MongoDB",
    "Redis",
    "Traefik",
    "Nginx",
    "Grafana/Loki",
    "Prometheus",
    "Alertmanager",
    "Portainer",
    "Mosquitto",
    "VerneMQ",
    "UFW/Firewalld",
    "OpenVPN",
    "Bash",
    "Markdown",
    "LaTeX",
    "REST",
    "GraphQL",
    "WebSockets",
    "Vue",
    "Bootstab",
    "Pandas",
    "Numpy",
    "Flask",
    "Boost",
    "Silenium"
  ]
}
