{
  "about_me": {
    "pic": "/img/me.jpg",
    "msg": [
      "Welcome to my website!",
      "My name is Henrik Gerdes. I am a computer science student at the University of Osnabrück (Germany). I have a passion for solving specific, difficult and large-scale problems in computer science and project management. I love finding elegant and efficient ways to automate recurring tasks. Last year I did some projects with computer/game graphics, low-level socket programming, and routing in graphs while writing my bachelor's thesis on applying DevOps principles to the software development process.",
      "Now I'm working at a local IT company as a systems engineer, expanding my knowledge of different cloud provider technologies, automated resource provisioning, monitoring, and maintenance. I love experimenting with different technologies and have gained knowledge in a variety of areas. For example, in software."
    ]
  },
  "home_row": [
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (1).jpg"
    },
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (2).jpg"
    },
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (3).jpg"
    },
    {
      "msg": "an university student from Osnabrück with passion for coding",
      "pic": "/img/slides/slide (4).jpg"
    }
  ],

  "fav_projects": [
    {
      "title": "Galaxy Fight",
      "msg": [
        "A round based 2D strategy game with 3D PvP fights.",
        "Players fight over the dominace of planets, while mining ressources to build new ships.",
        "It is basically a collection of my C++ skills. Including Templates,Boost, QT, OpenGL and SDL."
      ],
      "pic": "/img/galaxy.png"
    },
    {
      "title": "Pacmap",
      "msg": [
        "Want to play Pacman in your home town streets? Want to compete with your friends?",
        "Than play Pacmap. Its an multiplayer Pacman on street maps."
      ],
      "pic": "/img/pac.png"
    },
    {
      "title": "Beeblebrox CTF",
      "msg": [
        "A VM for IT-Sec starters to learn Unix and find common IT Security flaws.",
        "Full level based CTF with a accompanying website similare to the challenges at OverTheWire",
        "It includes Bash-Scripting, Web-Scraping and manipulation of Web-Authentication."
      ],
      "pic": "/img/ctf.png"
    }
  ],
  "language": [
    {
      "title": "PYTHON",
      "msg": "2 years data mining and manipulation. Also use of AI algorithms, PyGame and general scripting with Python 3.",
      "link": "none"
    },
    {
      "title": "WEB",
      "msg": "Fluid with HTML, CSS, JavaScript, TypeScript. NodeJS backend and frontend projects using express, OAS and VUE.JS. I can to create REST APIs and responsive website with bootstrab.",
      "link": "none"
    },
    {
      "title": "C/C++",
      "msg": "1 1/2 years developing algorithms, OpenGL vertices and GUI elements using QT",
      "link": "none"
    },
    {
      "title": "JAVA",
      "msg": "3 years of object oriented programming, multimedia tools, datatypes and software-engineering concepts.",
      "link": "none"
    }
  ],
  "skill": [
    "Git/SVN",
    "GitLab CI",
    "GitHub Actions",
    "Azure",
    "AWS",
    "Hetzner",
    "Horoku",
    "Netify",
    "Linux",
    "Ansible",
    "Docker",
    "MariaDB",
    "MongoDB",
    "Nginx",
    "Grafana",
    "Prometheus",
    "Portainer",
    "Wireshark",
    "Markdown",
    "LaTeX",
    "REST",
    "GraphQL",
    "WebSockets",
    "Vue",
    "Vuetify",
    "Bootstab",
    "Pandas",
    "Numpy",
    "Flask",
    "Dash",
    "Boost",
    "Silenium"
  ]
}
