{
  "papers": [
    {
      "title": "Connecting Software - ESB principles and solutions",
      "msg": [
        "Software solutions, especially for enterprise applications, currently demand extensive requirements. To meet these requirements, developers started to split monolithic applications into smaller parts to gain better scalability, maintainability and make them future-proof.",
        "This paper presents general principles and examples to connect these smaller applications allowing them to provide the same functionality as monolithic applications. Furthermore, this paper also presents several services for end-users to interconnect individual IoT devices from different manufacturers to work together. OpenGL and SDL."
      ],
      "pic": "/img/SWE-Connect.png",
      "link": { "url": "/docs/swe_connecting.pdf", "text": "View the paper" }
    },

    {
      "title": "MPTCP Scheduler",
      "msg": [
        "An increasing number of mobile nodes provide the ability to utilize multiple network paths. Multi-path connections are able to combine different network paths to enable increased goodput, resilience and seamless handovers between paths. MPTCP promises to do this while being backwards compatible. The performance achieved for latency and goodput depends on the network paths and how packets are scheduled on these paths. The following paper will summarize different scheduling algorithms, show their areas of application and point out their strengths and weaknesses."
      ],
      "pic": "/img/SYS_MPTCP_Scheduler.png",
      "link": { "url": "/docs/mptcp_scheduler.pdf", "text": "View the paper" }
    },

    {
      "title": "Beblebrox CTF - Training SEC CTF",
      "msg": [
        "This paper describes the process and structure of a CTF for IT security. Within an internship of a local IT-Security and Consulting company I created a training for security analysts and pen testers. The audience for this CTF are beginners at IT-Sec but they already should have common Linux skills. ",
        "The structure is similar to to the CTFs at OverTheWire, except the hosting is done local with an VirtualBox-Image. ",
        "After complexation the participant should have acquired the skills write basic bash scripts, know SQL injection, know how bypass web authentication, scrape the web with python, crack passwords and search for open ports. ",
        "Source is on GitHub, for the VM please contact me."
      ],
      "pic": "/img/ctf_paper.png",
      "link": { "url": "/docs/ctf_paper.pdf", "text": "View the paper" }
    },
    {
      "title": "Pacman Poster - Implementing Pacman on real streets",
      "msg": [
        "With the Shared Systems working group I created a multiplayer Pacman clone. The maps are based on real street maps. The goal is to acquire as many packages as possible without loosing them to the ghosts or other players.",
        "Maps can be dynamically generated. Street information are provided by the API of the OpenStreetMap (OSM) project. The ghost movement are based on the MSLAW and RandomStreet movement models, both models simulate real human movement. Rendering and game-logic are implemented with PyGame. ",
        "The poster gives a general overview about the project. It lists the used tools and process of development. All basic gameplay concepts are explained and design decisions are discussed."
      ],
      "pic": "/img/pac-poster_general.png",
      "link": { "url": "/docs/pac-poster-general.pdf", "text": "View the poster" }
    },
    {
      "title": "Pacman Poster - Metrics about game movement models",
      "msg": [
        "This poster is a more specific purpose based poster to the same Pacman project. After the development phase was done we were ask to do some scientific analyses on the game. ",
        "The poster systematical analyses the impact of MSLAW and RandomStreet movement parameters on game difficulty. For consistent testing purposes an AI player was created. Its movement was controlled by the OpenStreet-Routing-Machine (OSRM).",
        "Every parameter variation was run several times and gameplay events were logged. The data was than alkalized and visually processed."
      ],
      "pic": "/img/pac-poster.png",
      "link": { "url": "/docs/pac-poster-specific.pdf", "text": "View the poster" }
    },
    {
      "title": "Connecting Software - LaTeX Presentation",
      "msg": [
        "This presentation belongs to the paper about Connecting Software. It summarizes the acquired knowledge for the paper and visualizes the information in a appealing form. It introduces the fundamental concepts of application communication and functions of an ESB",
        " The document was created with LaTeX. Source can be found at my GitHub."
      ],
      "pic": "/img/SWE-Pres.png",
      "link": { "url": "/docs/connecting_pres.pdf", "text": "View the presentation" }
    }
  ],
  "language": []
}
